[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if(faces < 2)
-            faces = 6;
-        this._faces = faces;
-        this._last = 0;
-        this._distribution = new Map<number, number>();
-        
-        // Initializing the map with all the keys and setting their values to 0
-        for (let i = 1; i <= this._faces; i++)
-            this._distribution.set(i, 0);
-    }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: TypeError: Cannot read properties of undefined (reading 'set')

[Killed] ConditionalExpression
src/Roller.ts:10:12
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if(faces < 2)
+        if(false)
             faces = 6;
         this._faces = faces;
killedBy: Roller tests Rolling with less than 2 faces defaults to a 6-sided die.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] EqualityOperator
src/Roller.ts:10:12
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if(faces < 2)
+        if(faces >= 2)
             faces = 6;
         this._faces = faces;
killedBy: Roller tests Rolling with less than 2 faces defaults to a 6-sided die.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:17:25
         this._distribution = new Map<number, number>();
         
         // Initializing the map with all the keys and setting their values to 0
-        for (let i = 1; i <= this._faces; i++)
+        for (let i = 1; false; i++)
             this._distribution.set(i, 0);
     }
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] EqualityOperator
src/Roller.ts:17:25
         this._distribution = new Map<number, number>();
         
         // Initializing the map with all the keys and setting their values to 0
-        for (let i = 1; i <= this._faces; i++)
+        for (let i = 1; i < this._faces; i++)
             this._distribution.set(i, 0);
     }
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] BlockStatement
src/Roller.ts:31:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-
-        if (value < 1 || value > this._faces)
-            return 0;
-
-        // Storing the value in the last roll
-        this._last = value;
-
-        // Updating the distribution
-        this._distribution.set(value, this._distribution.get(value) + 1);
-
-        // return the value
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ConditionalExpression
src/Roller.ts:33:26
     //      of rolls for that face by 1
     roll(value: number): number{
 
-        if (value < 1 || value > this._faces)
+        if (value < 1 || false)
             return 0;
 
killedBy: Roller tests Rolling an invalid value doesn't update the last roll or distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 7

[Killed] EqualityOperator
src/Roller.ts:33:26
     //      of rolls for that face by 1
     roll(value: number): number{
 
-        if (value < 1 || value > this._faces)
+        if (value < 1 || value <= this._faces)
             return 0;
 
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 0

[Killed] ArithmeticOperator
src/Roller.ts:40:39
         this._last = value;
 
         // Updating the distribution
-        this._distribution.set(value, this._distribution.get(value) + 1);
+        this._distribution.set(value, this._distribution.get(value) - 1);
 
         // return the value
killedBy: Roller tests Rolling a valid value updates the last roll and distribution.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1
